summary_howtosolveit.org
Here is a subset of the how to solve it list, to focus on things I need to work on. like workout notes.
If also gives good mentality and values and expectations to have at each step.
* points to improve
+ what are some of your favorite questions? when were they useful?
+ try using an existing method to get a tangible result
+ trying to prove an idea that is false can be time consuming
+ Dont assume the answer to a complex problem
+ you need more precision at critical steps
  + identify the critical steps
* ahas
+ consider various sides of principal components and see if there are connections

* Personal Notes
** Getting Acquainted
+ visualize problem as a whole as clearly and vividly
+ dont concern yourself with details at the moment
+ What can I gain doing so?
  + Understand, familiarize the problem.
  + Impress the problem's purpose on your mind.
  + Attention bestowed on the problem may stimulate your memory and prepare for recollection

** Working for Better Understanding 
+ (Be more patient, impress it on your min)
+ Need to check if the problem is feasible, reasonable, through counter examples etc
+ Need to make sure I fully understand the problem
+ Comfortable with having the problem in my memory, looking away from it without fear of losing it altogether
+ Isolate the principal parts of the problem
+ Consider, one-by-one, in various combinations.
+ What can I gain by doing so?
  + Prepare and clarify details which are likely to play a role afterward

** Devising a plan
+ (When memory seems responsive, Manage, try various sides, be enduring, be patient, be grateful)
+ is the new unknown and new data nearer to each other?
+ Make sure you understand principal parts are distinctly arranged and clearly concieved
+ Carefully consider each part of the principal parts, considering them in various combinations
+ be grateful for hazy ideas
+ manage and explore the different options, not losing track
+ What could i perceive?
  + a helpful idea, a decisive idea that shows at a glance the way to the very end
+ How can an idea be helpful?
  + show the whole or a part of the way
  + suggests how you can proceed
+ What could I do with an incomplete idea
  + consider it. If it looks advatangeous you should consider it longer. If it looks reliable, ascertain how far it leads you and reconsider the situation
+ What can I gain doing so?
  + have another idea
  + perhaos the next idea will lead to the solution right away
  + perhaps you need a few more helpful ideas
  + perhaps younwill be led astray by some ideas
  + nevertheless be grateful for all new ideas, also for the lesser, hazy, supplementary ideas adding precision to a hazy one
  + even if you do not have any appreciable new ideas for a while, you should be grateful if your conception of the prblem becomes more cimolete, coherent, more homogeneousnor better balanced

** Carrying out the plan
+ (Need to be more through here)
+ Scrutinize, carefully, checking the step
+ divide small steps and big steps
+ What can I gain by doing so?
  + A presentation of the solution each step which is correct beyond doubt.
+ Stuck: know when and why the plan doesnt work

** Looking Back
+ (Need to focus here, have value)
+ See the solution at a glance, see it's point
+ Simpler intuitive solution
+ Fit into former knowledge
+ Scrutinize
+ Making extensive parts shorter
+ What can I gain by doing so? You may find a new and better solution, you may discover new and intersting facts. Get into the habit of surveying and scrutinizing your solutions in this way, you will acquire knowledge well ordered and reasy to use, and you will develop your ability of solving problems.


* How to Solve it List 
** Understand problem
+ What is the unknown, data, condition?
+ Is it a reasonable problem?
  + Is it possible to satisfy the condition?
  + Is the condition sufficient to determine the unknown?
  + Is it insufficient, redudant, contradictory?
+ Draw a figure
+ Introduce a suitable notation
+ Separate the various parts of the condition. Can you write them down?

** Devising a plan
+ Find the connection between the data and the unknown
+ Obliged to consider auxilary problems if an immediate connection cannot be found
+ You should obtain eventually a plan of the solution
+ Have you seen it before?
+ Have you seen the same problem in a slightly different form?
+ Do you know a related problem?
+ Do you know a theorem that could be useful?
+ Look at the unknown 
  + Try to think of a familiar problem having the same or a similar unknown
+ Here is a problem related to yours and solved before.
  + Could you use it, it's result, it's method?
  + Should you introduce some auxilary element in order to make its use possible?
  + Could you restate the problem?
  + Could you restate it still differently?
  + Go back to defintions
  
+ If you cannot solve the proposed problem, solve some related problem
+ Could you imagine a more accessible related problem?
+ A more general, more special, analogous
+ Could you solve a part of problem?
+ Keep only a part of the condition, drop the other part; 
  + How far is the unknown then determined, how could it vary?
+ Could you derive something useful from the data?
+ Could you think of other data appropriate to determine the unknown?
+ Could you change the unknown or the data, or both if neccesary?
  + So that the new unknown and the new data are nearer to each other?
+ Use all the data?
  + Did you use the whole condition?
  + Have you taken into account all essential notion involved int he problem?

** Carrying out the plan
+ Carrying out your plan of the solution.
+ Check each step.
+ Can you see clearly that the step is correct?
+ Can you prove that it is correct?

** Looking back
+ Can you check the result?
+ Can you check the argument?
+ Can you derive the result differently?
+ Can you see it at a glance?
+ Can you use the result, or the method, for some other problems?


* Quotes I like
+ solving problem is practical skill
  + like swimming
  + acquire by imitation and practice
  + plenty of opportunity
+ Acquire a taste for mathematics like a fast game of tennis



* ESC
+ what is unknown
+ what are the data
+ introduce suitable notation
+ is it a reasonable problem
+ is the condition sufficient to determine the unknown?
+ see how various items connect
+ see the main connection
+ carry out our plan
+ check each step
+ look back, review discuss
+ re-examine reconsider

