html/summary_howtosolveit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-23 Thu 21:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="termux" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc8d6f91">1. points to improve</a></li>
<li><a href="#orgfde2fa2">2. ahas</a></li>
<li><a href="#org9a9ff87">3. Personal Notes</a>
<ul>
<li><a href="#org748df93">3.1. Getting Acquainted</a></li>
<li><a href="#org043f7f5">3.2. Working for Better Understanding</a></li>
<li><a href="#org3012ce4">3.3. Devising a plan</a></li>
<li><a href="#orgd43e345">3.4. Carrying out the plan</a></li>
<li><a href="#org1cd51a1">3.5. Looking Back</a></li>
</ul>
</li>
<li><a href="#orgfe7116e">4. How to Solve it List</a>
<ul>
<li><a href="#org86340e4">4.1. Understand problem</a></li>
<li><a href="#org98f1fdb">4.2. Devising a plan</a></li>
<li><a href="#orgb0de170">4.3. Carrying out the plan</a></li>
<li><a href="#org2070e4b">4.4. Looking back</a></li>
</ul>
</li>
<li><a href="#org97f4413">5. Quotes I like</a></li>
<li><a href="#org2b036ec">6. ESC</a></li>
</ul>
</div>
</div>
<p>
Here is a subset of the how to solve it list, to focus on things I need to work on. like workout notes.
If also gives good mentality and values and expectations to have at each step.
</p>
<div id="outline-container-orgc8d6f91" class="outline-2">
<h2 id="orgc8d6f91"><span class="section-number-2">1.</span> points to improve</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>what are some of your favorite questions? when were they useful?</li>
<li>try using an existing method to get a tangible result</li>
<li>trying to prove an idea that is false can be time consuming</li>
<li>Dont assume the answer to a complex problem</li>
<li>you need more precision at critical steps
<ul class="org-ul">
<li>identify the critical steps</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgfde2fa2" class="outline-2">
<h2 id="orgfde2fa2"><span class="section-number-2">2.</span> ahas</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>consider various sides of principal components and see if there are connections</li>
</ul>
</div>
</div>

<div id="outline-container-org9a9ff87" class="outline-2">
<h2 id="org9a9ff87"><span class="section-number-2">3.</span> Personal Notes</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org748df93" class="outline-3">
<h3 id="org748df93"><span class="section-number-3">3.1.</span> Getting Acquainted</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>visualize problem as a whole as clearly and vividly</li>
<li>dont concern yourself with details at the moment</li>
<li>What can I gain doing so?
<ul class="org-ul">
<li>Understand, familiarize the problem.</li>
<li>Impress the problem's purpose on your mind.</li>
<li>Attention bestowed on the problem may stimulate your memory and prepare for recollection</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org043f7f5" class="outline-3">
<h3 id="org043f7f5"><span class="section-number-3">3.2.</span> Working for Better Understanding</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>(Be more patient, impress it on your min)</li>
<li>Need to check if the problem is feasible, reasonable, through counter examples etc</li>
<li>Need to make sure I fully understand the problem</li>
<li>Comfortable with having the problem in my memory, looking away from it without fear of losing it altogether</li>
<li>Isolate the principal parts of the problem</li>
<li>Consider, one-by-one, in various combinations.</li>
<li>What can I gain by doing so?
<ul class="org-ul">
<li>Prepare and clarify details which are likely to play a role afterward</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org3012ce4" class="outline-3">
<h3 id="org3012ce4"><span class="section-number-3">3.3.</span> Devising a plan</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>(When memory seems responsive, Manage, try various sides, be enduring, be patient, be grateful)</li>
<li>is the new unknown and new data nearer to each other?</li>
<li>Make sure you understand principal parts are distinctly arranged and clearly concieved</li>
<li>Carefully consider each part of the principal parts, considering them in various combinations</li>
<li>be grateful for hazy ideas</li>
<li>manage and explore the different options, not losing track</li>
<li>What could i perceive?
<ul class="org-ul">
<li>a helpful idea, a decisive idea that shows at a glance the way to the very end</li>
</ul></li>
<li>How can an idea be helpful?
<ul class="org-ul">
<li>show the whole or a part of the way</li>
<li>suggests how you can proceed</li>
</ul></li>
<li>What could I do with an incomplete idea
<ul class="org-ul">
<li>consider it. If it looks advatangeous you should consider it longer. If it looks reliable, ascertain how far it leads you and reconsider the situation</li>
</ul></li>
<li>What can I gain doing so?
<ul class="org-ul">
<li>have another idea</li>
<li>perhaos the next idea will lead to the solution right away</li>
<li>perhaps you need a few more helpful ideas</li>
<li>perhaps younwill be led astray by some ideas</li>
<li>nevertheless be grateful for all new ideas, also for the lesser, hazy, supplementary ideas adding precision to a hazy one</li>
<li>even if you do not have any appreciable new ideas for a while, you should be grateful if your conception of the prblem becomes more cimolete, coherent, more homogeneousnor better balanced</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd43e345" class="outline-3">
<h3 id="orgd43e345"><span class="section-number-3">3.4.</span> Carrying out the plan</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>(Need to be more through here)</li>
<li>Scrutinize, carefully, checking the step</li>
<li>divide small steps and big steps</li>
<li>What can I gain by doing so?
<ul class="org-ul">
<li>A presentation of the solution each step which is correct beyond doubt.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org1cd51a1" class="outline-3">
<h3 id="org1cd51a1"><span class="section-number-3">3.5.</span> Looking Back</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>(Need to focus here, have value)</li>
<li>See the solution at a glance, see it's point</li>
<li>Simpler intuitive solution</li>
<li>Fit into former knowledge</li>
<li>Scrutinize</li>
<li>Making extensive parts shorter</li>
<li>What can I gain by doing so? You may find a new and better solution, you may discover new and intersting facts. Get into the habit of surveying and scrutinizing your solutions in this way, you will acquire knowledge well ordered and reasy to use, and you will develop your ability of solving problems.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgfe7116e" class="outline-2">
<h2 id="orgfe7116e"><span class="section-number-2">4.</span> How to Solve it List</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org86340e4" class="outline-3">
<h3 id="org86340e4"><span class="section-number-3">4.1.</span> Understand problem</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>What is the unknown, data, condition?</li>
<li>Is it a reasonable problem?
<ul class="org-ul">
<li>Is it possible to satisfy the condition?</li>
<li>Is the condition sufficient to determine the unknown?</li>
<li>Is it insufficient, redudant, contradictory?</li>
</ul></li>
<li>Draw a figure</li>
<li>Introduce a suitable notation</li>
<li>Separate the various parts of the condition. Can you write them down?</li>
</ul>
</div>
</div>

<div id="outline-container-org98f1fdb" class="outline-3">
<h3 id="org98f1fdb"><span class="section-number-3">4.2.</span> Devising a plan</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Find the connection between the data and the unknown</li>
<li>Obliged to consider auxilary problems if an immediate connection cannot be found</li>
<li>You should obtain eventually a plan of the solution</li>
<li>Have you seen it before?</li>
<li>Have you seen the same problem in a slightly different form?</li>
<li>Do you know a related problem?</li>
<li>Do you know a theorem that could be useful?</li>
<li>Look at the unknown 
<ul class="org-ul">
<li>Try to think of a familiar problem having the same or a similar unknown</li>
</ul></li>
<li>Here is a problem related to yours and solved before.
<ul class="org-ul">
<li>Could you use it, it's result, it's method?</li>
<li>Should you introduce some auxilary element in order to make its use possible?</li>
<li>Could you restate the problem?</li>
<li>Could you restate it still differently?</li>
<li>Go back to defintions</li>
</ul></li>

<li>If you cannot solve the proposed problem, solve some related problem</li>
<li>Could you imagine a more accessible related problem?</li>
<li>A more general, more special, analogous</li>
<li>Could you solve a part of problem?</li>
<li>Keep only a part of the condition, drop the other part; 
<ul class="org-ul">
<li>How far is the unknown then determined, how could it vary?</li>
</ul></li>
<li>Could you derive something useful from the data?</li>
<li>Could you think of other data appropriate to determine the unknown?</li>
<li>Could you change the unknown or the data, or both if neccesary?
<ul class="org-ul">
<li>So that the new unknown and the new data are nearer to each other?</li>
</ul></li>
<li>Use all the data?
<ul class="org-ul">
<li>Did you use the whole condition?</li>
<li>Have you taken into account all essential notion involved int he problem?</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb0de170" class="outline-3">
<h3 id="orgb0de170"><span class="section-number-3">4.3.</span> Carrying out the plan</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Carrying out your plan of the solution.</li>
<li>Check each step.</li>
<li>Can you see clearly that the step is correct?</li>
<li>Can you prove that it is correct?</li>
</ul>
</div>
</div>

<div id="outline-container-org2070e4b" class="outline-3">
<h3 id="org2070e4b"><span class="section-number-3">4.4.</span> Looking back</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>Can you check the result?</li>
<li>Can you check the argument?</li>
<li>Can you derive the result differently?</li>
<li>Can you see it at a glance?</li>
<li>Can you use the result, or the method, for some other problems?</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org97f4413" class="outline-2">
<h2 id="org97f4413"><span class="section-number-2">5.</span> Quotes I like</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>solving problem is practical skill
<ul class="org-ul">
<li>like swimming</li>
<li>acquire by imitation and practice</li>
<li>plenty of opportunity</li>
</ul></li>
<li>Acquire a taste for mathematics like a fast game of tennis</li>
</ul>
</div>
</div>



<div id="outline-container-org2b036ec" class="outline-2">
<h2 id="org2b036ec"><span class="section-number-2">6.</span> ESC</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>what is unknown</li>
<li>what are the data</li>
<li>introduce suitable notation</li>
<li>is it a reasonable problem</li>
<li>is the condition sufficient to determine the unknown?</li>
<li>see how various items connect</li>
<li>see the main connection</li>
<li>carry out our plan</li>
<li>check each step</li>
<li>look back, review discuss</li>
<li>re-examine reconsider</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: termux</p>
<p class="date">Created: 2023-11-23 Thu 21:44</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
